# YOLOv11s + P2 detection head — 작은 객체(응애) 탐지 강화 변형
#
# 표준 YOLOv11 (cfg/models/11/yolo11.yaml)은 P3/P4/P5 (8x/16x/32x) 3-scale.
# 이 변형은 P2 (4x) head를 추가해 4-scale 탐지 → 작은 객체 mAP 향상.
#
# Trade-off:
#   + 응애처럼 매우 작은 객체에 큰 효과 (small object mAP +5~10pp 보고됨)
#   - 파라미터 ~5% 증가, latency ~10~15% 증가
#   - 메모리 사용량 증가 (P2 feature map은 P3 대비 4배 커짐)
#
# 검증 필요: 첫 학습 후 yolov11s default와 mAP@0.5/Recall@varroa 비교 → 선택.

nc: 2  # data.yaml의 nc로 자동 오버라이드

# 모델 스케일 — 's' 적용 시 depth=0.5, width=0.5
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone — 표준 YOLOv11 backbone 그대로
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                # 0  - P1/2
  - [-1, 1, Conv, [128, 3, 2]]               # 1  - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]        # 2  ← P2 feature 출력
  - [-1, 1, Conv, [256, 3, 2]]               # 3  - P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]        # 4  ← P3 feature 출력
  - [-1, 1, Conv, [512, 3, 2]]               # 5  - P4/16
  - [-1, 2, C3k2, [512, True]]               # 6  ← P4 feature 출력
  - [-1, 1, Conv, [1024, 3, 2]]              # 7  - P5/32
  - [-1, 2, C3k2, [1024, True]]              # 8
  - [-1, 1, SPPF, [1024, 5]]                 # 9
  - [-1, 2, C2PSA, [1024]]                   # 10 ← P5 feature 출력

# Head — 표준 PAN을 P2까지 확장
head:
  # ===== Top-down (FPN) =====
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]                    # 12 cat backbone P4
  - [-1, 2, C3k2, [512, False]]                  # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                    # 15 cat backbone P3
  - [-1, 2, C3k2, [256, False]]                  # 16  - P3/8-small

  # ★ P2 head 추가
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17
  - [[-1, 2], 1, Concat, [1]]                    # 18 cat backbone P2
  - [-1, 2, C3k2, [128, False]]                  # 19  - P2/4-xsmall (varroa target)

  # ===== Bottom-up (PAN) =====
  - [-1, 1, Conv, [128, 3, 2]]                   # 20
  - [[-1, 16], 1, Concat, [1]]                   # 21 cat head P3
  - [-1, 2, C3k2, [256, False]]                  # 22  - P3/8-small

  - [-1, 1, Conv, [256, 3, 2]]                   # 23
  - [[-1, 13], 1, Concat, [1]]                   # 24 cat head P4
  - [-1, 2, C3k2, [512, False]]                  # 25  - P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]]                   # 26
  - [[-1, 10], 1, Concat, [1]]                   # 27 cat head P5
  - [-1, 2, C3k2, [1024, True]]                  # 28  - P5/32-large

  # 4-scale Detect: P2(xsmall) + P3(small) + P4(medium) + P5(large)
  - [[19, 22, 25, 28], 1, Detect, [nc]]
